#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 1629                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: catherine621 <boj.kr/u/catherine621>        +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/1629                           #+#        #+#      #+#     #
#    Solved: 2025/03/25 21:06:58 by catherine621  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #


a, b, c = map(int,input().split())
# 계속 봐도 이해가 완벽히 되지 않는다 
# 재귀요정이 온다는 생각으로 푼다.
def power(a, b, c):
    # 그냥 b가 1이면 당연히 곱할게 없으니 a % c 
    if b == 1:
        return a % c
    # 거듭제곱의 수를 반으로 잘라가면서 푼다 .
    temp = power(a, b // 2, c)
    # 다 자른 후에 만약 b가 짝수면 
    if b % 2 == 0:
        return (temp * temp) % c
    # 홀수면 
    else:
        return (temp * temp * a) % c
      
print(power(a, b, c))